[
  {
    "name":"AI(artificial intelligence) ",
    "description":"AI stands for artificial intelligence, which is the simulation of human intelligence processes by machines or computer systems. AI can mimic human capabilities such as communication, learning, and decision-making."
  },
  {
    "name":"AI ethics",
  "description":"AI ethics refers to the issues that AI stakeholders such as engineers and government officials must consider to ensure that the technology is developed and used responsibly. This means adopting and implementing systems that support a safe, secure, unbiased, and environmentally friendly approach to artificial intelligence. "
  },
  {
    "name":"Algorithm",
    "description":"An algorithm is a sequence of rules given to an AI machine to perform a task or solve a problem. Common algorithms include classification, regression, and clustering."
  },
  {
    "name":"Voice Recognition",
    "description":"also called speech recognition, is a method of human-computer interaction in which computers listen and interpret human dictation (speech) and produce written or spoken outputs. Examples include Apple’s Siri and Amazon’s Alexa, devices that enable hands-free requests and tasks"
  },
  {
    "name":"Unsupervised learning",
    "description":" a type of machine learning in which an algorithm is trained with unclassified and unlabeled data so that it acts without supervision."
  },
  {
    "name":"Unstructured data",
    "description":"data that is undefined and difficult to search. This includes audio, photo, and video content. Most of the data in the world is unstructured."
  },
  {
    "name":"Turing Test",
    "description":"Jaribio la Turing was devised by Alan Turing in the 1950s, and is designed to assess or detect the presence of intelligence in AI systems. The test is set up like a game between three players: a human judge, a human player, and the AI system we wish to test. The human player and the AI system are hidden from the sight of the human judge. The goal of the judge is to guess which of the two hidden players is the AI system. The judge does this by asking questions to both players, especially questions which might trick the AI system into revealing itself. If after multiple rounds of questioning, the judge cannot decide which player is the AI system, the AI system itself is said to be intelligent. Translation: liliundwa na Alan Turing katika miaka ya 1950s na imeundwa ili kutathmini au kutambua uwepo wa uerevu kwenye mifumo ya AI. Jaribio hilo limesanidiwa kama mchezo kati ya wahusika watatu: hakimu binadamu, mhusika binadamu na mfumo wa AI ambao tungependa kuufanyia jaribio. Mhusika binadamu na mfumo wa AI umefichwa usionekane machoni pa hakimu binadamu. Lengo la hakimu huyo ni kutabiri ni mhusika yupi kati ya wale wawili waliofichwa ndiye mfumo wa AI. Hakimu anafanya hivyo kwa kuuliza maswali kwa wahusika, hususan maswali ambayo yanaweza kuweka mfumo wa AI mtego ili ujifichue. Ikiwa baada ya raondi kadhaa za kuuliza maswali, hakimu haweza kuamua ni mhusika yupi ndiye mfumo wa AI, mfumo wa AI wenyewe unadaiwa kuwa mwerevu. "
  },
  {
    "name":"Transfer Learning",
    "description":"a machine learning system that takes existing, previously learned data and applies it to new tasks and activities."
  },
  {
    "name":"Training data",
    "description":"is the information or examples given to an AI system to enable it to learn, find patterns, and create new content."
  },
  {
    "name":"Token",
    "description":"A token is a basic unit of text that an LLM uses to understand and generate language. A token may be an entire word or parts of a word."
  },
  {
    "name":" Cloud",
    "description":"Wingu is more of a metaphor than a proper scientific term, the ‘Cloud’ refers to a host of scalable, elastic, distributed and delocalized data storage and computing services. The ‘Cloud’ allows a user to store, modify, upload and download various types of data on to a web server, which that user can access from anywhere via an app, web browser or another dedicated platform with an internet connection. It also allows businesses to develop, train and run AI systems, through a process known as ‘cloud computing’. A bit like renting space on a computer that you can always access, the ‘Cloud’ serves as the backbone of many of today’s AI technologies.Translation: ni neno la kimajazi zaidi kuliko lilivyo istilahi ya kisanyansi, ‘Wingu’ inarejelea hifadhi ya data inayoweza kuwekwa katika viwango, nyumbufu na iliyosambazwa na kufikishwa maeneo ya mbali na huduma za kupiga hesabu. ‘Wingu’ humwezesha mtumiaji kuhifadhi, kubadilisha, kupakia na kupakua aina mbalimbali za data kwenye seva ya wavuti, ambayo mtumiaji huyo anaweza kufikia akiwa popote pale kupitia programu, kivinjari cha wavuti au mfumo mwingine wa kipekee wenye muunganisho wa intaneti. Pia inaruhusu bishara kuunda na kufunza na kuendesha mifumo ya AI, kupitia mchakato unaofahamika kama ‘kupiga hesabu kwenye wingu’. Ni kama kukodisha nafasi kwenye kompyuta ambayo unaweza kutumia kila mara kufikia seva za ‘Wingu’ kama msingi wa teknolojia nyingi za AI za leo. "
  },
  {
    "name":"Synthetic Data",
    "description":"artificially created by computers or algorithms based on real-world data sets. This data type is widely recognized for its ability to train machine learning models, reduce biases in data sets, and navigate ethical and privacy concerns surrounding real data."
  },
  {
    "name":"Symbolic AI",
    "description":"AI ya Ishara- which is also called top-down, or ‘expert systems’, is a type of algorithmic process that follows explicit and transparent rules, given to the system by human programmers, to compute the solution to a problem. Symbolic AI constitutes the original and oldest approach to Artificial Intelligence, but it’s still used today in many AI applications, especially in situations where high levels of human control are desirable, such as in the case of driverless cars.Translation: ambayo pia inaitwa juu-chini au ‘mifumo ya kitaalamu’ ni aina ya mchakato wa kialgorithi inayofuata sheria bayana na wazi, inayowekwa kwenye mfumo na wanaprogramu binadamu, ili kufanya hesabu ya suluhu kwa tatizo. AI ya Ishara inajumuisha mbinu halisi na ya zamani zaidi ya umaizi bandia, lakini bado inatumiwa leo katika programu nyingi za AI, hususan katika hali ambapo viwango vya juu vya udhibiti wa binadamu vinatakikana, kama vile katika hali za magari yanayoendeshwa bila dereva binadamu."
  },
  {
    "name":"Supervised learning",
    "description":"is a type of machine learning in which classified output data is used to train the machine and produce the correct algorithms. It is much more common than unsupervised learning. "
  },
  {
    "name":"Structured query language",
    "description":"The acronym SQL, pronounced either 'sequel' or 'S-Q-L',stands for Structured Query Language. It is a universal programming language used to manage relational databases. Many relational database management systems (RDBMS) support the SQL language, including MySQL, SQL Server, and Oracle."
  },
  {
    "name":"Structured data",
    "description":"data that is defined and searchable. This includes data like phone numbers, dates, and product SKUs. "
  },
  {
    "name":"Sentiment Analysis",
    "description":"Also known as opinion mining, sentiment analysis is the process of using AI to analyze the tone and opinion of a given text."
  },
  {
    "name":"Reinforcement learning",
    "description":"is a type of machine learning in which an algorithm learns by interacting with its environment and then is either rewarded or penalized based on its actions. "
  },
  {
    "name":"Recruitment Tools ",
    "description":"Zana za Uajiri denote the use of Artificial Intelligence to automate some part of the hiring process. This can include the automatic scheduling of interviews with candidates, the shortlisting of candidates (through analysis and recommendation), candidate matching, chatbots, or AI-based phone or video interviewers. Today, most recruitment processes are not fully automated, working instead to provide decision assistance to the humans in charge of the recruitment process. Translation: zinahusu matumizi ya umaizi bandia kufanya sehemu fulani ya mchakato wa kuajiri watu kufanywa kiotomatiki. Hii inajumuisha kuratibu mahojiano kiotomatiki na waliotuma maombi, kuandaa orodha ya watu waliohitimu (kupitia uchambuzi na mapendekezo), kulinganisha waliotuma maombi, boti za gumzo au waendeshaji mahojiano kwenye simu au video inayoendeshwa na AI. Leo, michakato mingi ya kuajiri haifanyiki kiotomatiki kikamilifu, badala yake tunajitahidi kutoa usaidizi wa kufanya maamuzi kwa binadamu wanaosimamia mchakato wa kuajiri. "
  },
  {
    "name":"Quantum computing",
    "description":"Quantum computing is the process of using quantum-mechanical phenomena such as entanglement and superposition to perform calculations. "
  },
  {
    "name":"Prompt",
    "description":"A prompt is an input that a user feeds to an AI system in order to get a desired result or output. "
  },
  {
    "name":"Prescriptive analytics",
    "description":"type of analytics that uses technology to analyze data for factors such as possible situations and scenarios, past and present performance, and other resources to help organizations make better strategic decisions. "
  },
  {
    "name":"Predictive analytics",
    "description":"type of analytics that uses technology to predict what will happen in a specific time frame based on historical data and patterns. "
  },
  {
    "name":"Pattern recognition",
    "description":"method of using computer algorithms to analyze, detect, and label regularities in data. This informs how the data gets classified into different categories. "
  },
  {
    "name":"Overfitting",
    "description":"occurs in machine learning training when the algorithm can only work on specific examples within the training data. A typical functioning AI model should be able to generalize patterns in the data to tackle new tasks."
  },
  {
    "name":"Neural network",
    "description":"A neural network is a deep learning technique designed to resemble the human brain’s structure. Neural networks require large data sets to perform calculations and create outputs, which enables features like speech and vision recognition. "
  },
  {
    "name":"Natural Language Processing (NLP)",
    "description":"Uchakataji wa Lugha Halisi (NLP) is the branch of Artificial Intelligence research dedicated to giving computers the ability to understand text and spoken words in ways similar to humans. Typically, NLP combines traditional linguistic methods such as the rule-based modelling of a language, with statistical or machine learning methods. Traditionally a hard problem in AI research, natural language processing has greatly improved with the use of machine learning, and can be found in many everyday AI applications such as voice assistants, speech-to-text dictation software, automated translation and chatbots.Translation:  ni tawi la utafiti wa umaizi bandia linaloshughulikia kuzipa kompyuta uwezo wa kuelewa matini na maneno yanayozungumzwa na binadamu. Kwa kawaida, NLP hujumuisha mbinu za kale za kisiimu kama vile miundo iliyojikita katika kanuni ya lugha, na mbinu za takwimu au za mafunzo ya mashine. Ikiwa ni tatizo gumu kwa kawaida katika utafiti wa AI, uchakataji wa lugha halisi umeimarika pakubwa kwa matumizi ya mafunzo ya mashine, na unaweza kupatikana katika programu nyingi za AI za kila siku kama vile miratibu ya sauti, programu za sauti hadi matini, tafsiri otomatiki na boti za gumzo. "
  },
  {
    "name":"Moravec’s Paradox",
    "description":"Kinaya ya Moravec describes a surprising gap between the intellectual capacities of humans and even advanced AI systems, where AI systems can be seen to excel in a number of traditionally ‘difficult’ human fields (for instance, statistical reasoning, pattern recognition or playing checkers), but perform poorly in many areas that most humans can easily master: perception, mobility, common sense and value judgements, to name a few. Translation: hueleza tofauti ya kushangaza iliyopo kati ya uwezo wa kiakili wa binadamu na hata mifumo ya kina ya AI, ambapo mifumo ya AI inaweza kuonekana kufanikiwa katika nyanja ambazo kwa kawaida ni ‘ngumu’ kwa binadamu (kwa mfano, kutoa mantiki ya takwimu, utambuzi wa mitindo au kucheza drafu), lakini hufanya vibaya katika nyanja nyingi ambapo binadamu anaweza kudhibiti kwa urahisi: mtazamo, uhamaji,maarifa ya kawaida, uamuzi wa kiadilifu, na kadhalika."
  },
  {
    "name":"Metadata",
    "description":"data about data. It describes attributes of your data that can be important to know, but may not be immediately relevant to your data's primary function. This could include information about how data was collected, where it's stored, and how it's used."
  },
  {
    "name":"Massive Open Online Courses (MOOCs) ",
    "description":"Kozi Kubwa Wazi za Mtandaoni (MOOC) are completely distributed and virtual learning platforms, available to students globally. One of the principal keys to life- long learning, MOOCs enable students, and more generally individuals, to engage with and learn from toptier professionals in both the sciences and humanities with online courses. MOOCs come in many forms, from completely self-directed platforms that allow students to work through the course at their own pace, to accredited professional degree programs that allow students to bolster their formal education.Translation: ni mifumo ya mafunzo mtandaoni ambayo husambazwa kikamilifu, inayopatika kwa wanafunzi kote duniani. Mojawapo ya kanuni muhimu za maisha- mafunzo marefu, MOOC huwezesha wanafunzi na watu binafsi kwa ujumla zaidi kushiriki na kujifunza kutoka kwa wataalamu bora katika kozi za mtandaoni za sayansi na jamii. MOOC huja kwa namna nyingi, kutoka mifumo za kujielekeza kikamilifu inayowezesha wanafunzi kufanya kazi wakati wa kozi hiyo kwa mwendo wao binafsi, hadi programu zilizoidhinishwa za shahada ya kitaalama. Zinazowezesha wanafunzi kuboresha elimu yao rasmi. "
  },
  {
    "name":"Machine Learning",
    "description":"Mafunzo ya Mashine is also called ‘data-driven’ or ‘bottom-up’ AI, machine learning is an adaptive type of algorithmic process which allows computers to learn from experience, learn by example, or learn by analogy, using large amounts of data, where the learning processes improve the performance of the system over time. Closely related to Artificial Neural Networks (ANNs), many machine learning practices are inspired by the structure of the human brain. ANNs use very simple and highly connected processors (called neurons) with weighted links, which pass signals from one neuron to another. The learning process occurs when these weights are adjusted as the system receives training data input, eventually storing the ‘trained’ rules required for correctly solving a given problem — such as classification or pattern recognition — which are used in decision-making when new data is fed into the system.Translation: inaitwa pia AI ‘inayoendeshwa na data’ au ‘chini-juu’, mafunzo ya mashine ni aina tohozi ya mchakato wa kialgorithi inayowezesha kompyuta kujifunza kutokana na uzoefu, kujifunza kwa mfano, au kujifunza kwa mlinganisho, kwa kutumia kiasi kikubwa cha data, ambapo michakato ya kujifunza huboresha utendaji wa mfumo huo kwa muda. Ikiwa inahusiana kwa karibu na Mitandao Neurali Bandia (ANN), mafunzo mengi ya mashine huchochewa na muunda wa ubongo wa binadamu. ANN hutumia vichakataji rahisi na zilizounganishwa kwa hali ya juu (zinazoitwa neuroni) zenye viungo vilivyo na uzani, ambavyo hupitia ishara kutoka kwenye neuroni moja hadi nyingine. Mchakato wa kujifunza hutokea wakati mizani hii imerekebishwa mfumo huwa unaendelea kupokea mafunzo kuweka data, hatimaye kuhifadhi sheria ‘zilizofunzwa’ zinazohitajika ili kutatua tatizo fulani kwa usahihi — kama vile uanishaji au utambuzi wa mitindo — ambayo hutumiwa katika kufanya uamuzi wakati data mpya imeingizwa kwenye mfumo."
  },
  {
    "name":"Large language model",
    "description":"A large language model (LLM) is an AI model that has been trained on large amounts of text so that it can understand language and generate human-like text. Limited memory Limited memory is a type of AI system that receives knowledge from real-time events and stores it in the database to make better predictions. "
  },
  {
    "name":"Hyperparameter",
    "description":"A hyperparameter is a parameter, or value, that affects the way an AI model learns. It is usually set manually outside of the model. Image recognition Image recognition is the process of identifying an object, person, place, or text in an image or video."
  },
  {
    "name":"Halucination",
    "description":"refers to an incorrect response from an AI system, or false information in an output that is presented as factual information."
  },
  {
    "name":"Guardrails",
    "description":"restrictions and rules placed on AI systems to make sure that they handle data appropriately and don't generate unethical content. "
  },
  {
    "name":"Generative AI",
    "description":"Generative AI is a type of technology that uses AI to create content, including text, video, code and images. A generative AI system is trained using large amounts of data, so that it can find patterns for generating new content."
  },
  {
    "name":"Fiber Optic",
    "description":"Muunganisho wa Faiba is a type of technology used to transmit information as pulses of light through strands of fiber made of glass or plastic over long distances. Because fiber optic cables transfer data signals in the form of light rather than by using the traditional method of electrical signals, the information is able to travel faster, over longer distances, and without the risk of electromagnetic interference (for instance, from storms or strong winds). Fiber optic cables are part of the essential infrastructure of modern-day AI practices.Translation: ni aina ya teknolojia inayotumiwa kuhamisha taarifa kama mipigo ya mwangaza kwenye mikamba ya faiba iliyoundwa kwa glasi au plastiki kwa umbali mrefu. Kwa sababu kebo za muunganisho wa faiba huhamisha ishara ya data katika muundo wa mwangaza badala ya kutumia mbinu za kale za ishara za umeme, taarifa inaweza kusafiri haraka zaidi, kwa masafa marefu zaidi na bila hatari ya hitilafu za sumaku- umeme (kwa mfano, kutokana na dhoruba au upepo mkali). Kebo za muunganisho wa faiba ni sehemu ya muun"
  },
  {
    "name":"Epoch",
    "description":"is a type of hyperparameter in machine learning which denotes the number of times that the learning algorithm will work through the entire training dataset, adjusting its weights to each sample in the set. Most AI models run through many epochs (sometimes over 1000) across their training, since up to a certain point at least, each epoch helps the engineers to minimize the errors in the model, or to optimize its performance.Translation: ni aina ya kigezo cha kudhibiti mchakato wa mafunzo katika mafunzo ya mashine ambacho kinaashiria mara ambazo algorithi ya kujifunza itafanya kazi kwenye setidata nzima ya mafunzo, kurekebisha uzani wake katika kila sampuli kwenye seti. Miundo mingi ya AI inaendeshwa kwenye vigezo vingi vya epoch (wakati mwingine zaidi ya 1000) katika mafunzo yao, kwa kuwa hadi kiwango fulani angalau, kila kigezo cha epoch kinasaidia wahandisi kupunguza hitilafu kwenye miundo hiyo au kuboresha utendaji wake. "
  },
  {
    "name":"Emergent behavior",
    "description":"also called emergence, is when an AI system shows unpredictable or unintended capabilities."
  },
  {
    "name":"Echo",
    "description":"Chamber Chemba ya Mwangwi occurs when a group of participants on a (social media) platform chose to preferentially connect with one another, to the exclusion of outsiders. Over time, this exclusion of outsiders (and the diversity of opinion that often comes with them) can lead to a situation in which users are increasingly insulated from dissenting opinions on a specific topic. This in turn may push these users towards ever more extreme versions of the opinions that initially lead them to take interest in the group, creating an environment where each member of the group ‘echoes’ the opinions of the others. Translation: hutokea wakati kundi la washiriki kwenye mfumo wa (mtandao wa kijamii) wakichagua kama mapendeleo yao kuunganishwa na wenzao, na kutenga watu wa nje. Baada ya muda, kutengwa huku kwa watu wa nje (na hali anuwai ya mawazo ambayo mara nyingi hutokana nao) inaweza kusababisha hali ambapo watumiaji wanazidi kulindwa dhidi ya maoni pingamani kuhusu mada mahususi. Hii inaweza kuwasukuma watumiaji hawa hadi misimo mikali zaidi ya maoni ambayo awali iliwasababisha kuvutiwa na kikundi, na kuweka mazingira ambapo kila mwanakikundi ‘anashadidia’ maoni ya wengine. "
  },
  {
    "name":"Digital Divide",
    "description":"Ukosefu wa Usawa wa Kidijitali describes the gap between individuals, households, businesses or geographic areas in terms of access to, a) AI research, b) knowledge, education and human resources, c) training data, and d) connectivity and hardware. Put another way, the digital divide is what prevents a truly global and equal playing field in AI technology, where those who are disadvantaged lack the tools to be able to compete and collaborate with highly developed players in the AI ecosystem. Translation: inafafanua tofauti iliyopo kati ya watu, familia, biashara au maeneo ya kijiografia kuhusiana na ufikiaji wa, a) Utafiti wa AI, b) maarifa, elimu na rasilimali za binadamu, c) data ya mafunzo na d) muunganisho na maunzi. Kwa maneno mengine, ukosefu wa usawa wa kidijitali ni kile kinachozuia kuwepo uwanja wa kimataifa na wa sawa katika teknolojia ya AI, ambapo wale wasiojiweza wamekosa zana za kuwawezesha kushindana na kushirikiana na wahusika wenye ujuzi wa juu katika mazingira ya AI. "
  },
  {
    "name":"Dial-Up Connection",
    "description":"Muunganisho wa Kupiga is an internet connection that is achieved using a regular telephone line. When the phone line is connected to a modem and configured to dial a particular number, this grants a user internet access. Dial-up is the slowest form of internet connection, and today, persists mainly in areas where it is not economically possible or viable to construct broadband lines.Translation: simu ni muunganisho wa mtandao ambao unapatikana kwa kutumia laini ya kawaida. Laini ya simu ikiunganishwa kwenye modemu na kusanidiwa ili kupiga nambari fulani, hii inampa mtumiaji uwezo wa kufikia intaneti. Kupiga simu ni aina ya muunganisho ulio polepole zaidi wa mtandao, na leo, bado unatumika tu katika maeneo ambapo haiwezekani kiuchumi kujenga laini za brodbandi. "
  },
  {
    "name":"Deep learning",
    "description":"is a function of AI that imitates the human brain by learning from how it structures and processes information to make decisions. Instead of relying on an algorithm that can only perform one specific task, this subset of machine learning can learn from unstructured data without supervision."
  },
  {
    "name":"Data science",
    "description":"is an interdisciplinary field of technology that uses algorithms and processes to gather and analyze large amounts of data to uncover patterns and insights that inform business decisions. "
  },
  {
    "name":"Data mining",
    "description":"Data mining is the process of sorting through large data sets to identify patterns that can improve models or solve problems."
  },
  {
    "name":"Data",
    "description":"Seti ya Data is sometimes called a ‘database’, a data set is simply a collection of structured data. In other words, it’s a collection of things like facts, measurements, observations, images, text, audio or video, or representations thereof. Data sets are integral to Artificial Intelligence. In fact, without data sets, AI would not be able to learn, perceive, categorize, speak, listen or interpret, to name just a few. Data sets can be large or small, public or private, balanced or biased, but no matter the details, data sets provide the backbone for bottom-up, machine learning, or what we rightly call data- driven AI.Translation: wakati mwingine huitwa ‘kanzidata’, seti ya data ni mkusanyiko wa data iliyoundwa. Kwa maneno mengine, ni mkusanyiko wa mambo kama vile ukweli, vipimo, mitazamo, picha, matini, sauti au video au uwakilisho wake. Seti za data ni muhimu kwa umaizi bandia. Ukweli, bila seti za data, AI haingeweza kujifunza, kudhani, kuainisha, kuzungumza, kusikiliza au kufasiri miongoni mwa mambo mengine. Seti za data zinaweza kuwa kubwa au ndogo, za umma au za faragha, zilizosawazishwa au zenye upendeleo, lakini licha ya maelezo yake, seti za data zinatoa uti wa mgongo wa chini- juu, mafunzo ya mashine au kile tunachokiita kwa usahihi kama AI inayoendeshwa na data. "
  },
  {
    "name":"Cookies",
    "description":"Vidakuzi are small files which are placed on a user’s computer through their internet browser, each time the user visits a website, in order to collect and track information about that user. Some cookies, known as session cookies, exist primarily to ensure the proper functioning of a specific website while the user engages with its content, for instance, by remembering language preferences. Other cookies, usually called persistent cookies, are stored permanently on a user’s computer, and allow tracking across websites, helping to boost the accuracy of the targeted ads each user sees no matter what website they visit. Translation: ni faili ndogo zinazowekwa kwenye kompyuta ya mtumiaji kupitia kivinjari cha intaneti, kila wakati mtumiaji anatembelea wavuti, ili kukusanya na kufuatilia taarifa kuhusu mtumiaji huyo. Baadhi ya vidakuzi, vinavyojulikana kama vidakuzi vya vipindi, vipo kimsingi ili kuhakikisha utendakazi ufaao wa tovuti mahususi huku mtumiaji akitagusana na maudhui yake, kwa mfano, kwa kukumbuka mapendeleo ya lugha. Vidakuzi vingine ambavyo huitwa vidakuzi vya kudumu, huhifadhiwa kabisa kwenye kompyuta ya mtumiaji, na kuruhusu ufuatiliaji kwenye tovuti mbalimbali, na kusaidia usahihi wa matangazo yanayolenga ambayo kila mtumiaji huona licha ya tovuti anayoitembelea."
  },
  {
    "name":"Content Personalization",
    "description":"Ubinafsishaji wa Maudhui or recommender systems, describes a popular mode by which different AI platforms (social media, marketplaces, content platforms, and more) filter the content to which they expose their users. These platforms collect information (or data) about the personal habits and interests of their users (e.g., which books a given user has purchased, which songs they like, which web pages they’ve visited) and use this to recommend new content, products or services to their users. Recommender systems like these tend to suggest new content to users in one of two ways: either by looking for new content that is associated with the content a user has already liked or engaged with, called content filtering; or by pairing users with similar interests together, through a practice called collaborative filtering. Interestingly, when a user engages with a platform for the first time, the recommender system will struggle to know what content the user will likely enjoy for lack of sufficient data, a phenomenon called the Cold Start Problem. Translation: au mifumo ya kipendekezaji, unafafanua mbinu maarufu ambayo mifumo tofauti ya AI (mitandao ya kijamii, masoko, mifumo ya maudhui na zaidi) huchuja maudhui ambayo wanawaonyesha watumiaji wao. Mifumo hii hukusanya taarifa data) kuhusu tabia na mapendeleo ya kibinafsi ya watumiaji wao (m.f., vitabu vipi mtumiaji fulani amekinunua, nyimbo ambazo anazipenda, ukurasa za wavuti ambazo ametembelea) na kutumia taarifa hizi kupendekeza maudhui, bidhaa au huduma kwa watumiaji wao. Kipendekezaji mifumo kama hii hupendekeza maudhui mapya kwa watumiaji kwa njia moja kati ya mbili: ama kwa kutafuta maudhui mapya ambayo yanahusishwa na maudhui ambayo tayari matumiaji amependa au kutagusana nayo, hii inaitwa uchujaji wa maudhui; au kwa kuoanisha watumiaji na mapendeleo ya pamoja, kupitia tukio linaloitwa uchujaji shirikishi. Cha kushangaza ni kwamba, mtumiaji anapotagusana na mfumo kwa mara ya kwanza, mfumo wa kipendekezaji utatatizika kufanya maudhui ambayo mtumiaji huenda akafurahia kutokana na ukosefu wa data ya kutosha, hali inayoitwa Tatizo la Mwanzo Finyu."
  },
  {
    "name":"Content Moderation ",
    "description":"Ukaguzi wa Maudhui describes the process by which humans or Artificial Intelligence decide which content is allowed on a specific platform or forum, typically in alignment with the platform or forum’s community standards, guidelines, or terms of service. Today, most major platforms are moderated by a combination of humans and AI systems. In part, this is due to the striking amount of new content which is uploaded every day—far too much for humans alone to handle. While AIpowered moderation is an efficient solution to this problem, it’s inability to detect linguistic nuance, such as humor or sarcasm on one hand, combined with pressure from various governmental bodies to censor unfavorable content across platforms on the other, may threaten freedom of expression and lead to increased online censorship. Translation: unaeleza mchakato ambapo binadamu au umaizi bandia unaamua maudhui ambayo yanaruhusiwa kwenye mfumo au jukwaa mahususi, kwa kawaida kwa kuambatana na viwango vya jumuiya, miongozo au sheria na masharti ya mfumo au jukwaa hilo. Leo, mifumo mingi mikuu inakaguliwa na binadamu pamoja na Mifumo ya AI. Kwa upande mmoja, hii inatokana na kiasi kikubwa cha maudhui ambayo hupakiwa kila siku, ambayo ni kubwa mno kwa binadamu pekee kushughulikia. Ingawa ukaguzi unaoendeshwa na AI ni suluhu bora kwa tatizo hili, kutoweza kwake kugundua utofauti wa kiisimu, kama vile ucheshi au kejeli kwa upande mmoja, pamoja na shinikizo kutoka katika mashirika ya serikali kudhibiti maudhui yasiyofaa kwenye mifumo yote kwa upande mwingine, inaweza kutishia uhuru wa kujieleza na kusababisha kuongeza kwa udhibiti wa mawasiliano mtandaoni."
  },
  {
    "name":"Computer vision",
    "description":"is an interdisciplinary field of science and technology that focuses on how computers can gain understanding from images and videos. For AI engineers, computer vision allows them to automate activities that the human visual system typically performs."
  },
  {
    "name":"Community Guidelines",
    "description":"Viwango vya Jumuiya are sometimes associated with ‘Terms of Service’, and are a set of rules created by a platform or social networking site that dictate the types of behavior forbidden or expected of the human users that engage with the platform. Most generally, community guidelines are designed to ensure a safe environment for users to interact (for instance, by forbidding hate speech or the dissemination of medical disinformation), but can also include legal considerations such as copyright infringement. Importantly, they provide the standard by which all content is judged on the platform, and thus, platform moderation (by humans or AI systems) works to enforce the community guidelines. Translation: wakati mwingine huhusishwa na ‘Sheria na Masharti’, na ni seti za sheria zinazoundwa na mfumo au tovuti ya mtandao wa kijamii zinazobainisha aina ya tabia ambazo zimeharamishwa au ambazo watumiaji wanatarajiwa kuwa nayo ili kutagusana na jukwaa hilo. Kwa ujumla zaidi, miongozo ya jumuiya imeundwa ili kuhakikisha mazingira salama kwa watumiaji kutagusana (kwa mfano, kwa kuharamisha matamshi ya chuki au usambazaji wa taarifa potovu za kimatibabu), lakini pia inaweza kujumuisha mazingatio ya sheria kama vile ukiukaji wa hakimiliki. Muhimu zaidi, inatoa viwango ambavyo maudhui yote yanastahili kutimiza kwenye mfumo, na hivyo, ukaguzi wa mfumo (na binadamu au mifumo wa AI) hutumika ili kutekeleza viwango vya jumuiya. "
  },
  {
    "name":"Cognitive computing",
    "description":"Cognitive computing is essentially the same as AI. It’s a computerized model that focuses on mimicking human thought processes such as pattern recognition and learning. Marketing teams sometimes use this term to eliminate the sci-fi mystique of AI."
  },
  {
    "name":"Classification Classifier algorithms",
    "description":"Algorithi za Uainishaji are models, in the case of supervised machine learning, that learn from input training data to eventually predict the likelihood that the samples from a new and different data set will fall into one of the predetermined categories of classification (also known as ‘sub-populations’). In other words, the model first learns categories and their associations from the labels human engineers provide it during training, and then uses what it learns to sort new data into these same categories. Translation: ni miundo, ambayo katika kesi yamafunzo yanayosimamiwa ya mashine, ambayo inajifunza kutokana na data inayowekwa ya mafunzo ili hatimaye kubashiri uwezekano kwamba sampuli kutoka kwa seti mpya na tofauti ya data itapatikana kwenye kategoria iliyobainishwa mapema ya uainishaji (pia inafahamika kama ‘kategoria ndogo ya idadi ya watu’) Kwa maneno mengine, muundo huo kwanza unajifunza kategoria na uhusiano wao kutokana na lebo ambazo wahandisi binadamu wanaipa wakati wa kujifunza, na kisha kutumia kilichojifunza kupanga data mpya kwenye kategoria hizi."
  },
  {
    "name":"Chatbot",
    "description":"Boti ya Gumzo- is a type of virtual AI assistant (a computer program) designed to mimic conversation with a human user, typically over the internet or some virtual interface, via text or text and speech. Chatbots can provide useful information to users or direct them to appropriate resources, and play a key role in addressing the needs of users at scale.Translation: ni aina ya mratibu wa AI mtandaoni (programu ya kompyuta) iliyoundwa kuiga mazungumzo na mtumiaji binadamu, kwa kawaida mtandaoni au kwenye kiolesura fulani cha mtandaoni, kupitia maandishi au maandishi na matamshi. Boti ya magumzo zinaweza kutoa taarifa muhimu kwa watumiaji au kuwaelekeza kwenye rasilimali zinazofaa na kuchukua nafsi muhimu katika kushughulikia mahitaji ya watumiaji katika kiwango."
  },
  {
    "name":"Big data",
    "description":"is the act of summarizing, grouping or otherwise organizing the raw data of a given data set into a summary form for statistical analysis. While this can and has been performed by humans in the past (through traditional statistical analysis), the age of Big Data ushers in the need for AI solutions to extract, recognize or extrapolate patterns in these incredibly large data sets, which are then used for a variety of applications. For instance, data aggregation is at work behind many of today’s recommender systems, grouping similar users together, or pairing a user with a new product, page or interest group. Translation: ni kitendo cha kutoa muhtasari, kuweka kwenye makundi au vinginevyo kupanga data halisi kutokana na seti fulani ya data kwa muhtasari kwa ajili ya uchambuzi wa takwimu. Ingawa hii inaweza na imefanywa na binadamu simu za nyuma (kupitia uchambuzi wa jadi wa takwimu), enzi ya Data Kubwa imekuja na hitaji la suluhu za AI ili kuopoa, kutambua au kuchanganua mitindo kwenye seti hizi kubwa sana za data, ambazo kisha zinatumiwa kwa matumizi mbalimbali. Kwa mfano, ujumlishaji wa data ndiyo hutumika ndani ya mifumo mingi ya kipendekezaji ya leo, kuweka pamoja watumiaji wanaofanana, au kuoanisha mtumiaji na bidhaa, ukurasa au kikundi kipya cha mapendeleo."
  },
  {
    "name":"Augmented Intelligence",
    "description":"Uerevu Ulioongezwa is a term which describes the cooperation of humans and AI towards a human goal, or within a socio-technical system. The AI can be both virtual (like a decision-assistance system), or embodied (like a robotic factory worker). In other words, augmented intelligence is what occurs when humans and AI work together and is seen to be more efficient than either party working on their own. Translation: ni istilahi inayoeleza ushirikiano wa binadamu na AI kufikia lengo la binadamu, au ndani ya mfumo wa kijamii na kiufundi. Hiyo AI inaweza kuwa mtandaoni (kama vile mfumo wa kusaidia kufanya uamuzi) au kufanywa mfano (kama vile mfanyakazi wa kiwandani wa kiroboti) Kwa maneno mengine, uerevu ulioongezwa ni kile kinachofanyika wakati binadamu na AI zinafanya kazi pamoja na inaonekana kuwa na ufanisi zaidi kuliko kila mhusika akifanya kazi kivyake. "
  },
  {
    "name":"Artificial Narrow Intelligence (ANI)",
    "description":"umaizi bandia Mwembamba (ANI) is otherwise known as ‘Domain Specific’ or ‘Weak AI’, ANI is a type of AI whose capacities and model are limited to a specific context. This means that while the AI system may perform better than a human at the task for which it is designed, such as driving in traffic, playing checkers, or recognizing faces; it is unable to perform any other task for which it was not designed, such as walking in traffic, playing chess or drawing faces. ANI is the only form of AI that humanity has achieved so far.Translation:  iambao ni maarufu pia kama ‘Ya Kikoa Mahususi’ au ‘AI Dhaifu’, ANI ni aina ya AI ambayo uwezo na muundo wake una kikomo katika muktadha mahususi. Hii inamaanisha kwamba ingawa mfumo wa AI unaweza kufanya vyema kulika binadamu kwa kazi ambayo imeundwa kufanya, kama vile kama kuendesha trafiki, kucheza viteuzi, au kutambua nyuso, haiwezi kufanya kazi nyingine nyingi ambayo iliundwa kufanya, kama vile kutembea kwenye trafiki, kucheza chesi au kuchora nyuso. ANI ndiyo namna pekee ya AI ambayo binadamu amefanikiwa kupata kufikia sasa. "
  },
  {
    "name":"Artificial General Intelligence (AGI)",
    "description":"umaizi bandia wa Jumla (AGI)- is understood as the overarching, and, as yet, unachieved, goal of designing a system with the ability to learn new skills and act intelligently in many domains, and which can mimic or even surpass human intelligence. Strong AI or AGI thus refers to a machine that has consciousness and is capable of providing human-like responses.Translation- inaeleweka kama lengo tondoti, na, ambalo bado halijafikiwa la kuunda mfumo ulio na uwezo wa kujifunza ujuzi mpya na kutenda kwa uerevu katika vikoa vingi na ambalo linaiga au hata kupita uerevu wa binadamu. AI au AGI thabiti inarejelea mashine ambayo ina ufahamu na inawea kutoa majibu sawa na ya binadamu."
  },
  {
    "name":"Application programming interface (API)",
    "description":"An API, or application programming interface, is a set of protocols that determine how two software applications will interact with each other. APIs tend to be written in programming languages such as C++ or JavaScript"
  },
  {
    "name":"Algorithmic Bias",
    "description":"an umbrella term which describes the ways in which certain AI systems can generate outputs, decisions or recommendations which display an inclination or prejudice for or against a person or group, especially in a way that is considered to be unfair. The causes of these biases are multiple, relating to how representative the data set is, how large the data set is, the weights of the AI model itself, and even the conscious and subconscious inclinations of the system’s programmers. Even if most well-designed AI systems are free from algorithmic bias, ensuring that AI systems always operate fairly remains a thorny topic amongst AI professionals.Translation- Upendeleo wa Kialgorithi- ni istilahi ya jumla inayoeleza njia ambazo mifumo fulani ya AI inaweza kuzalisha matokeo, maamuzi au mapendekezo yanayoonyesha kuegemea upande mmoja au mapendeleo kwa au dhidi ya mtu au kikundi, hususan kwa njia zinazozingatiwa kuwa zisizo na usawa. Sababu za upendeleo huu ni nyingi, zinahusiana na jinsi seti ya data ilivyowakilishi, ukubwa wa seti ya data, uzani wa muundo wa AI wenyewe na hata upendeleo wa kujua na wa kutojua wa wanaprogramu wa mfumo. Hata kama mifumo nyingi iliyoundwa vyema ya AI haina upendeleo wa algorithi, kuhakikisha kwamba mifumo ya AI inatumika kwa usawa ni mada kuu miongoni mwa wataalamu wa AI."
  },
  {
    "name":"Algorithm",
    "description":"An algorithm is a sequence of rules given to an AI machine to perform a task or solve a problem. Common algorithms include classification, regression, and clustering."
  }
]